04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/CHT/wallBoiling/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 2.62e6;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            prghPressure;
        p               $internalField;
        value           $internalField;
    }
    wall
    {
        type            fixedFluxPressure;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
